In [2]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\jay revin rendora\appdata\local\programs\python\python311\lib\site-packages (8.0.32)
Requirement already satisfied: protobuf<=3.20.3,>=3.11.0 in c:\users\jay revin rendora\appdata\local\programs\python\python311\lib\site-packages (from mysql-connector-python) (3.20.3)

In [32]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import random

import datetime
from datetime import datetime, timedelta
import scipy.stats


import mysql.connector as connector

import warnings
warnings.filterwarnings('ignore')

%matplotlib inline
#sets the default autosave frequency in seconds
%autosave 60 
sns.set_style('dark')
sns.set(font_scale=1.2)

plt.rc('axes', titlesize=9)
plt.rc('axes', labelsize=14)
plt.rc('xtick', labelsize=12)
plt.rc('ytick', labelsize=12)

pd.set_option('display.max_columns',None)
#pd.set_option('display.max_rows',None)
pd.set_option('display.width', 1000)
pd.option_context('float_format','{:.2f}'.format)

random.seed(0)
np.random.seed(0)
np.set_printoptions(suppress=True)

Autosaving every 60 seconds

In [33]:
import mysql.connector as connector

In [34]:
connection = connector.connect(user = "root", password = "password", db = "littlelemondb")

In [21]:
cursor = connection.cursor(buffered = True)

In [35]:
pd.read_sql_query('SHOW tables', connection)

  Tables_in_littlelemondb
0                bookings
1          contactdetails
2                customer
3          deliverystatus
4               joinsview
5                   menus
6                  orders
7              ordersview
8                   staff

In [37]:
pd.read_sql_query("""SELECT customer.Name AS 'Full Name', ContactDetails.PhoneNumber as 'Contact Number' FROM customer
                    INNER JOIN contactdetails
                    ON customer.CustomerID = contactdetails.CustomerID
                    INNER JOIN orders
                    ON contactdetails.CustomerID = orders.CustomerID
                    WHERE orders.TotalCost > 60
                    """, connection)

Empty DataFrame
Columns: [Full Name, Contact Number]
Index: []